In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [36]:
data = [1,2,3,4]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
key = ['a','b','c','d']
series = pd.Series(data,index=key)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
data = {'name':['tejas','shubhi','pravin'],'age':[25,30,35],'salary':[5000,6000,5500]}
df = pd.DataFrame(data)
df

     name  age  salary
0   tejas   25    5000
1  shubhi   30    6000
2  pravin   35    5500

In [12]:
df[['name','age']]

     name  age
0   tejas   25
1  shubhi   30

In [29]:
df['city'] = ['pune','chattisgarh','pune']
df

     name  age  salary         city
0   tejas   25    5000         pune
1  shubhi   30    6000  chattisgarh
2  pravin   35    5500         pune

In [16]:
ndata = pd.DataFrame(['tejas',20])
ndata

       0
0  tejas
1     20

In [30]:
df['age_sal_sum'] = df['age']+df['salary']
df

     name  age  salary         city  age_sal_sum
0   tejas   25    5000         pune         5025
1  shubhi   30    6000  chattisgarh         6030
2  pravin   35    5500         pune         5535

In [31]:
filtered_data = df[df['age']>25]
filtered_data

     name  age  salary         city  age_sal_sum
1  shubhi   30    6000  chattisgarh         6030
2  pravin   35    5500         pune         5535

In [32]:
sorted_df = df.sort_values('salary',ascending=False)
sorted_df

     name  age  salary         city  age_sal_sum
1  shubhi   30    6000  chattisgarh         6030
2  pravin   35    5500         pune         5535
0   tejas   25    5000         pune         5025

In [35]:
group_by = df.groupby('city')['salary'].mean()
group_by

city
chattisgarh    6000.0
pune           5250.0
Name: salary, dtype: float64